package com.jijizu.core.user.service;

import java.util.List;
import java.util.Map;

import com.jijizu.core.dto.JsonResult;
import com.jijizu.core.dto.PaginationDTO;
import com.jijizu.core.search.dto.UserSearch;
import com.jijizu.core.user.dto.ChildInfo;
import com.jijizu.core.user.dto.CompanyInfo;
import com.jijizu.core.user.dto.LivingCommunity;
import com.jijizu.core.user.dto.RecommendUser;
import com.jijizu.core.user.dto.SchoolInfo;
import com.jijizu.core.user.dto.UserInfo;
import com.jijizu.core.user.dto.UserJob;
import com.jijizu.core.user.dto.UserSchool;

public interface UserInfoService {
	
	/**   
	 *******************************************************************************
	 * @function : 重置密码
	 * @param logName
	 * @param userId
	 * @param random
	 * @param password
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-4-14   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult resetPwd(String logName,Long userId,String random,String password);
	
	/**   
	 *******************************************************************************
	 * @function : 找回密码
	 * @param logName
	 * @param iCode
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-4-13   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult findPwd(String logName,String iCode) throws Exception;
	
	/**   
	 *******************************************************************************
	 * @function : 获取推荐用户
	 * @param userId
	 * @param size
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-26   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<RecommendUser> findRecommendUser(Long userId,Long size);
	
	/**   
	 *******************************************************************************
	 * @function : 获取用户新消息提示
	 * @param sessionUserInfo
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-18   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult getUserMessage(UserInfo sessionUserInfo);

	/**   
	 *******************************************************************************
	 * @function : 根据用户ID获取用户信息
	 * @param userId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2012-12-18   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	UserInfo getUserInfoById(Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 根据用户ID获取用户信息
	 * @param userId
	 * @param isLoadSchoolAndJob 是否加载学校和工作信息
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-28   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	UserInfo getUserInfoById(Long userId,boolean isLoadSchoolAndJob);
	
	/**   
	 *******************************************************************************
	 * @function : 用户注册
	 * @param para
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2012-12-20   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult registerUser(Map<String,Object> para);
	
	/**   
	 *******************************************************************************
	 * @function : 更新用户信息
	 * @param para
	 * @param sessionUserInfo
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-24   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult updateUserInfo(Map<String,Object> para,UserInfo sessionUserInfo);
	
	/**   
	 *******************************************************************************
	 * @function : 用户登录
	 * @param logName
	 * @param password
	 * @param target
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2012-12-21   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult userLogin(String logName,String password,String target,boolean aotuLogin);
	
	/**   
	 *******************************************************************************
	 * @function : 根据名字获取用户
	 * @param name
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-5   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	UserInfo getUserInfoByName(String name);
	
	/**   
	 *******************************************************************************
	 * @function : 获取at记录用户
	 * @param refId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-5   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<UserInfo> findUserInfoByAtRecord(Long refId);
	
	/**   
	 *******************************************************************************
	 * @function : 根据昵称获取用户
	 * @param nickName
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-7   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	UserInfo getUserInfoByNickName(String nickName);
	
	/**   
	 *******************************************************************************
	 * @function : 更新用户头像
	 * @param sessionUserInfo
	 * @param headImgUrl
	 * @param x
	 * @param y
	 * @param h
	 * @param w
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-15   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	void updateHeadImage(UserInfo sessionUserInfo,String headImgUrl,int x,int y,int h,int w);
	
	/**   
	 *******************************************************************************
	 * @function : 添加工作信息 
	 * @param sessionUserInfo
	 * @param companyName
	 * @param province
	 * @param city
	 * @param startYear
	 * @param endYear
	 * @param department
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-18   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult addUserJob(UserInfo sessionUserInfo, String companyName,
			String province, String city, String startYear, String endYear,String department);
	
	/**   
	 *******************************************************************************
	 * @function : 查询用户工作信息
	 * @param userId
	 * @param rownum
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-18   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<UserJob> findUserJob(Long userId,Long rownum);
	
	/**   
	 *******************************************************************************
	 * @function : 查询用户工作信息
	 * @param userId
	 * @param rownum
	 * @param isLoadUsers
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<UserJob> findUserJob(Long userId,Long rownum,boolean isLoadUsers);
	
	/**   
	 *******************************************************************************
	 * @function : 删除用户工作信息
	 * @param jobId
	 * @param sessioUserInfo
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-18   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult deleteUserJob(Long jobId,UserInfo sessioUserInfo);
	
	/**   
	 *******************************************************************************
	 * @function : 通过名称查找公司信息
	 * @param companyName
	 * @param rownum
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-20   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<CompanyInfo> findCompanyByName(String companyName,Long rownum);
	
	/**   
	 *******************************************************************************
	 * @function : 更新用户工作信息
	 * @param sessionUserInfo
	 * @param jobId
	 * @param companyName
	 * @param province
	 * @param city
	 * @param startYear
	 * @param endYear
	 * @param department
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-20   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult updateUserJob(UserInfo sessionUserInfo,Long jobId,String companyName,
			String province,String city,String startYear,String endYear,String department);
	
	/**   
	 *******************************************************************************
	 * @function : 添加用户学校信息
	 * @param sessionUserInfo
	 * @param schoolId
	 * @param department
	 * @param type
	 * @param startYear
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-21   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult addUserSchool(UserInfo sessionUserInfo,Long schoolId,String department,String type,String startYear,String schoolName);
	
	/**   
	 *******************************************************************************
	 * @function : 查询学校信息
	 * @param type
	 * @param areaName
	 * @param schoolName
	 * @param firstLetter	首字母
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-21   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<SchoolInfo> findSchoolInfo(String type,String areaName,String schoolName,String firstLetter);
	
	/**   
	 *******************************************************************************
	 * @function : 查询用户学校信息
	 * @param userId
	 * @param rownum
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-21   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<UserSchool> findUserSchool(Long userId,Long rownum);
	
	/**   
	 *******************************************************************************
	 * @function : 查询用户学校信息
	 * @param userId
	 * @param rownum
	 * @param isLoadUser
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<UserSchool> findUserSchool(Long userId,Long rownum,boolean isLoadUser);

	/**   
	 *******************************************************************************
	 * @function : 删除用户学校信息
	 * @param userId
	 * @param schoolId
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-21   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult deleteUserSchool(UserInfo sessionUserInfo,Long id);
	
	/**   
	 *******************************************************************************
	 * @function : 更新用户学校信息
	 * @param userSchoolId
	 * @param userId
	 * @param schoolId
	 * @param department
	 * @param type
	 * @param startYear
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-23   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult updateUserSchool(UserInfo sessionUserInfo,Long userSchoolId,Long schoolId,String department,String type,String startYear,String schoolName);
	
	/**   
	 *******************************************************************************
	 * @function : 保存学校信息
	 * @param schoolName
	 * @param type
	 * @param areaLevel
	 * @param areaName
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-24   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	Long saveSchoolInfo(String schoolName,String type,String areaLevel,String areaName);
	
	/**   
	 *******************************************************************************
	 * @function : 添加孩子信息
	 * @param para
	 * @param sessionUserInfo
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-24   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult addChild(Map<String,Object> para,UserInfo sessionUserInfo);
	
	/**   
	 *******************************************************************************
	 * @function : 根据用户查询孩子信息
	 * @param userId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-25   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<ChildInfo> findChildInfoByUserId(Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 删除孩子信息
	 * @param sessionUserInfo
	 * @param childId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-25   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult deleteChild(UserInfo sessionUserInfo,Long childId);
	
	/**   
	 *******************************************************************************
	 * @function : 更新孩子信息
	 * @param sessionUserInfo
	 * @param para
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-25   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult updateChild(UserInfo sessionUserInfo,Map<String,Object> para);
	
	/**   
	 *******************************************************************************
	 * @function : 查询生活小区
	 * @param name
	 * @param areaName
	 * @param rownum
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-27   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	List<LivingCommunity> findLivingCommunity(String name,String areaName,String areaFatherName,int rownum);
	
	/**
	 * 
	 *******************************************************************************
	 * @function : 登出
	 * @param userId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-28   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult logOut(Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 更新用户读取评论时间
	 * @param userId
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-18   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	void updateUserReadCommentTime(Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 更新用户读取at时间
	 * @param userId
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-18   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	void updateUserReadAtTime(Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 查询用户
	 * @param userSearch
	 * @param pageNum
	 * @param pageSize
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-27   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findUserListPage(UserSearch userSearch,long pageNum, long pageSize);
	
	/**   
	 *******************************************************************************
	 * @function : 查找用户更具微博数排序
	 * @param userId
	 * @param pageNum
	 * @param pageSize
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-7   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findUserOrderByStatusNumPage(Long userId,long pageNum, long pageSize);
	
	/**   
	 *******************************************************************************
	 * @function : 根据公司名称查找用户（分页）
	 * @param userId
	 * @param companyId
	 * @param pageNum
	 * @param pageSize
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findUserByCompanyPage(Long userId,Long companyId,long pageNum, long pageSize);
	
	/**   
	 *******************************************************************************
	 * @function : 通过ID获得生活小区
	 * @param id
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-27   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	LivingCommunity getLivingCommunityById(Long id);
	
	/**   
	 *******************************************************************************
	 * @function : 根据生活小区查询用户
	 * @param userId
	 * @param livingCommunityId
	 * @param pageNum
	 * @param pageSize
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findUserByLivingCommunityPage(Long userId,Long livingCommunityId,Long district,long pageNum, long pageSize);
	
	/**   
	 *******************************************************************************
	 * @function : 根据学校查找用户(分页)
	 * @param userId
	 * @param schoolId
	 * @param pageNum
	 * @param pageSize
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findUserBySchoolPage(Long userId,Long schoolId,long pageNum, long pageSize);
	
	/**   
	 *******************************************************************************
	 * @function : 根据孩子的学校查找用户
	 * @param userId
	 * @param schoolId
	 * @param pageNum
	 * @param pageSize
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-13   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findUserByChildSchoolPage(Long userId,Long schoolId,long pageNum, long pageSize);
	
	/**   
	 *******************************************************************************
	 * @function : 根据ID获取孩子信息
	 * @param childId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-25   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	ChildInfo getChildInfoById(Long childId);
	
}
