package com.jijizu.core.follow.dao;

import com.jijizu.core.dto.PaginationDTO;
import com.jijizu.core.user.dto.UserInfo;

public interface FollowDAO {

	/**   
	 *******************************************************************************
	 * @function : 关注某人
	 * @param userId		关注发起人
	 * @param followUserId	被关注人
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2012-12-31   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	long followOne(Long userId,Long followUserId);
	
	/**   
	 *******************************************************************************
	 * @function : 判断两个用户是否互相关注
	 * @param userId1
	 * @param userId2
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2012-12-31   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	boolean isFollowEachOther(Long userId1,Long userId2);
	
	/**   
	 *******************************************************************************
	 * @function : 获取好友
	 * @param pageNum
	 * @param pageSize
	 * @param userId
	 * @param nickName
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-4   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findFriendsPage(long pageNum, long pageSize,Long userId,String nickName);
	
	/**   
	 *******************************************************************************
	 * @function : 获取共同好友
	 * @param pageNum
	 * @param pageSize
	 * @param userId1
	 * @param userId2
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-9   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findCommonFriendsPage(long pageNum,long pageSize,Long userId1,Long userId2);
	
	/**   
	 *******************************************************************************
	 * @function : 取消关注
	 * @param userId
	 * @param followUserId
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-9   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	void followCancel(Long userId,Long followUserId);
	
	/**   
	 *******************************************************************************
	 * @function : 获取发送申请好友
	 * @param pageNum
	 * @param pageSize
	 * @param userId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-8   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findSendApplyFriendsPage(long pageNum,long pageSize,Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 是否已关注某人
	 * @param userId
	 * @param followUserId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-19   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	boolean hasFollowUser(Long userId,Long followUserId);
	
}
