package com.jijizu.core.album.service;

import java.util.List;

import com.jijizu.core.album.dto.AlbumInfo;
import com.jijizu.core.album.dto.PhotoInfo;
import com.jijizu.core.dto.JsonResult;
import com.jijizu.core.dto.PaginationDTO;
import com.jijizu.core.user.dto.UserInfo;

public interface AlbumService {
	
	/**   
	 *******************************************************************************
	 * @function : 批量更新照片信息
	 * @param sessionUserInfo
	 * @param photoList
	 * @param cover
	 * @param albumId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-16   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult updatePhotoBatch(UserInfo sessionUserInfo,List<PhotoInfo> photoList,Long cover,Long albumId);
	
	/**   
	 *******************************************************************************
	 * @function : 批量删除照片
	 * @param sessionUserInfo
	 * @param albumId
	 * @param photoIds
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-15   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult deletePhotoBatch(UserInfo sessionUserInfo,Long albumId,String photoIds);
	
	/**   
	 *******************************************************************************
	 * @function : 批量移动照片
	 * @param sessionUserInfo
	 * @param albumId
	 * @param photoIds
	 * @param sourceAlbumId 原相册ID
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-15   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult movePhotoBatch(UserInfo sessionUserInfo,Long albumId,String photoIds,Long sourceAlbumId);
	
	/**   
	 *******************************************************************************
	 * @function : 更新照片信息
	 * @param sessionUserInfo
	 * @param photoId
	 * @param content
	 * @param name
	 * @param isSetCover	是否设置为相册封面
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-13   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult updatePhoto(UserInfo sessionUserInfo,Long photoId,String content,String name,boolean isSetCover);
	
	/**   
	 *******************************************************************************
	 * @function : 删除照片
	 * @param sessionUserInfo
	 * @param photoId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult deletePhoto(UserInfo sessionUserInfo,Long photoId);
	
	/**   
	 *******************************************************************************
	 * @function : 编辑相册信息
	 * @param sessionUserInfo
	 * @param albumId
	 * @param name
	 * @param content
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult updateAlbum(UserInfo sessionUserInfo,Long albumId,String name,String content);
	
	/**   
	 *******************************************************************************
	 * @function : 删除相册
	 * @param sessionUserInfo
	 * @param albumId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-10   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult deleteAlbum(UserInfo sessionUserInfo,Long albumId);
	
	/**   
	 *******************************************************************************
	 * @function : 创建相册
	 * @param sessionUserInfo
	 * @param name
	 * @param content
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-10   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult createAlbum(UserInfo sessionUserInfo,String name,String content);

	/**   
	 *******************************************************************************
	 * @function : 创建默认相册
	 * @param userId
	 * @param createUserId
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-8   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	void createDefaultAlbum(Long userId,Long createUserId);
	
	/**   
	 *******************************************************************************
	 * @function : 发布微博照片
	 * @param userId
	 * @param mediaUrl
	 * @param statusId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-9   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	Long postStatusPhoto(Long userId,String mediaUrl,Long statusId);
	
	/**   
	 *******************************************************************************
	 * @function : 查询用户相册
	 * @param pageNum
	 * @param pageSize
	 * @param userId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-9   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<AlbumInfo> findUserAlbumPage(long pageNum, long pageSize,Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 查询相册照片
	 * @param pageNum
	 * @param pageSize
	 * @param albumId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<PhotoInfo> findPhotoPage(long pageNum, long pageSize,Long albumId);
	
	/**   
	 *******************************************************************************
	 * @function : 获取相册信息
	 * @param albumId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	AlbumInfo getAlbumById(Long albumId);
	
	/**   
	 *******************************************************************************
	 * @function : 获取照片信息
	 * @param photoId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-12   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PhotoInfo getPhotoInfoById(Long photoId);
	
	/**   
	 *******************************************************************************
	 * @function : 获取上一张照片
	 * @param photoId
	 * @param albumId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-15   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PhotoInfo getPrePhotoById(Long photoId,Long albumId);
	
	/**   
	 *******************************************************************************
	 * @function : 获取下一张照片
	 * @param photoId
	 * @param albumId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-15   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PhotoInfo getNextPhotoById(Long photoId,Long albumId);
	
	/**   
	 *******************************************************************************
	 * @function : 获取照片信息
	 * @param photoId
	 * @param isLoadStatus 是否加载微博信息
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-15   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PhotoInfo getPhotoInfoById(Long photoId,boolean isLoadStatus);
	
	/**   
	 *******************************************************************************
	 * @function : 保存照片
	 * @param name
	 * @param content
	 * @param albumId
	 * @param imgUrl
	 * @param statusId
	 * @param groupId
	 * @param createUserId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-9   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	Long savePhoto(String name,String content,Long albumId,String imgUrl,
			Long statusId,Long groupId,Long createUserId);
	
	/**   
	 *******************************************************************************
	 * @function : 获取用户微博配图
	 * @param userId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-9   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	AlbumInfo getUserStatusAlbum(Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 查询相册照片
	 * @param pageNum
	 * @param pageSize
	 * @param userId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-17   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<PhotoInfo> findPhotoByUserIdPage(long pageNum, long pageSize,Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 通过groupId查询照片
	 * @param pageNum
	 * @param pageSize
	 * @param groupId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-17   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<PhotoInfo> findPhotoByGroupIdPage(long pageNum, long pageSize,Long groupId);
	
	/**   
	 *******************************************************************************
	 * @function : 集集组获取下一张照片
	 * @param photoId
	 * @param groupId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-18   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PhotoInfo getGroupNextPhotoById(Long photoId,Long groupId);
	
	/**   
	 *******************************************************************************
	 * @function : getGroupPrePhotoById
	 * @param photoId
	 * @param groupId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-18   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PhotoInfo getGroupPrePhotoById(Long photoId,Long groupId);
	
}
