<%@page language="java" pageEncoding="UTF-8"%>
<%@ include file="/common.jsp" %>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>集集组是一个平台，方便家长组织好友，带着孩子们聚在一起，玩耍、交流、分享。</title>
<link href="${CSS_PATH}/global.css" rel="stylesheet" type="text/css" />
<link type="image/x-icon" href="favicon.ico" rel="shortcut icon"/>
<!--[if IE 6]>
<script type="text/javascript" src="js/DD_belatedPNG_0.0.8a.js"></script>
<![endif]-->
</head>

<body class="temp">
<!--主体部分-->
<div class="wrap announce_bg">
    <div class="announce_content">
    	<h1>隐私申明</h1>
        <p>欢迎访问集集组！我们以本隐私申明声明对访问者隐私保护的许诺。以下文字公开我站（集集组.com）对信息收集和使用的情况。本站的隐私申明正在不断改进中，随着我站服务范围的扩大，我们会随时更新我们的隐私申明。我们欢迎您随时会来查看本申明。请向 jijizu01@jijizu.com反馈您的意见。</p>
        <p>在同意集集组服务协议（"协议"）之时，你已经同意我们按照本隐私申明来使用和披露您的个人信息。本隐私申明的全部条款属于该协议的一部份。</p>
        <h2>未成年人的特别注意事项</h2>
        <p>如果您未满18周岁，您无权使用公司服务，因此我们希望您不要向我们提供任何个人信息。如果您未满18周岁，您只能在父母或监护人的陪同下才可以使用公司服务。</p>
        <h2>用户名和密码</h2>
        <p>当您打算注册成用户后，我们要求您选择一个用户名和密码，还要提供密码提示问题及其答案以便在您丢失密码后我们可以确认您的身份。您只能通过您的密码来使用您的帐号。如果您泄漏了密码，您可能丢失了您的个人识别信息，并且有可能导致对您不利的司法行为。因此不管任何原因使您的密码安全受到危及，您应该立即通过service@集集组.cn和我们取得联系。</p>
        <h2>注册信息</h2>
        <p>当您在注册为用户时，我们要求您填写一张注册表。注册表要求提供您的真实姓名，地址，国籍，电话号码，和电子邮件地址。如果您是公司客户，您还被要求提供您的公司的地址，电话号码和贵公司的服务和产品的简短说明。您还有权选择来填写附加信息。这些信息可能包括您公司所在的省份和城市，时区和邮政编码，传真号码，主页和您的职务。我们使用注册信息来获得用户的统计资料。我们将会用这些统计数据来给我们的用户分类，以便有针对性地向我们的用户提供新的服务。我们会通过您的邮件地址来通知您这些新的服务。</p>
        <h2>您的交易行为</h2>
        <p>我们跟踪IP地址仅仅只是为了安全的必要。如果我们没有发现任何安全问题，我们会及时删除我们收集到的IP地址。我们还跟踪全天的页面访问数据。全天页面访问数据被用来反映网站的流量，一是我们可以为未来的发展制定计划（例如，增加服务器）。</p>
        <h2>广告</h2>
        <p>我们会对个人身份数据进行综合统计，并为销售和奖励的需要将该综合统计向广告主披露。</p>
        <h2>邮件/短信/会刊服务</h2>
        <p>集集组保留通过邮件、短信、邮寄会刊的形式，对本网站注册、购物用户发送订单信息、促销活动等告知服务的权利。如果您在集集组注册、购物，表明您已默示同意接受此项服务。如果您不想接收来自集集组的邮件、短信或会刊，您可以向集集组客服提出退阅申请，并注明您的E-mail地址、手机号或相关地址信息，集集组会在收到申请后为您办理退阅。</p>
        <h2>第三方</h2>
        <p>我们不会向任何第三方提供，出售，出租，分享和交易用户的个人信息，除非第三方和集集组一起为网站和用户提供服务并且在该服务结束后已将被禁止访问包括其以前能够访问的所有这些资料。当我们被法律强制或依照政府要求提供您的信息时我们将善意地披露您的资料。</p>
        <h2>信息的存储和交换</h2>
        <p>用户信息和资料被收集和存储在放置于中国的服务器上。只有为了做备份的需要时，我们才可能需要将您的资料传送到别国的服务器上。</p>
        <h2>外部链接</h2>
        <p>本站含有到其他网站的链接。集集组对那些网站的隐私保护措施不负任何责任。我们可能在任何需要的时候增加商业伙伴或共用品牌的网站，但是提供给他们的将仅仅是综合信息，我们将不会公开您的身份。</p>
        <h2>安全</h2>
        <p>我们网站有相应的安全措施来确保我们掌握的信息不丢失，不被滥用和变造。这些安全措施包括向其它服务器备份数据和对用户密码加密。尽管我们有这些安全措施，但请注意在因特网上不存在"完善的安全措施"。</p>
        <h2>修改您的资料</h2>
        <p>您可以随时在集集组的网站修改或者更新你的个人信息和密码（在成功登录之后）。</p>
        <h2>联系我们</h2>
        <p>如果你对本隐私申明或集集组的隐私保护措施以及您在使用中的问题有任何意见和建议请和我们联系：<a href="mailto:jijizu01@jijizu.com">jijizu01@jijizu.com</a>。</p>
    </div>
</div>
<!--尾部文件-->
<%@include file="/common/footer.jsp" %>
<!--弹出框-->
</body>
</html>
