package com.jijizu.core.follow.service;

import com.jijizu.core.dto.JsonResult;
import com.jijizu.core.dto.PaginationDTO;
import com.jijizu.core.user.dto.UserInfo;

public interface FollowService {
	
	/**   
	 *******************************************************************************
	 * @function : 批量取消关注
	 * @param sessionUserInfo
	 * @param userIds
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-8   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult followCancelBatch(UserInfo sessionUserInfo,String userIds);

	/**   
	 *******************************************************************************
	 * @function : 关注用户
	 * @param sessionUserInfo
	 * @param followUserId		被关注人
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2012-12-31   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult followUser(UserInfo sessionUserInfo,Long followUserId);
	
	/**
	 * 
	 *******************************************************************************
	 * @function : 关注官方账号
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-2-28   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	void followOfficeAccount(Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 获取好友
	 * @param pageNum
	 * @param pageSize
	 * @param userId
	 * @param nickName
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-4   
	 *******************************************************************************
	 * Reviser ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findFriendsPage(long pageNum, long pageSize,Long userId,String nickName);
	
	/**   
	 *******************************************************************************
	 * @function : 获取共同好友
	 * @param pageNum
	 * @param pageSize
	 * @param userId1
	 * @param userId2
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-9   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findCommonFriendsPage(long pageNum,long pageSize,Long userId1,Long userId2);
	
	/**   
	 *******************************************************************************
	 * @function : 判断两个用户是否互相关注
	 * @param userId1
	 * @param userId2
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2012-12-31   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	boolean isFollowEachOther(Long userId1,Long userId2);
	
	/**   
	 *******************************************************************************
	 * @function : 取消关注
	 * @param sessionUserInfo
	 * @param followUserId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-1-9   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult followCancel(UserInfo sessionUserInfo,Long followUserId);
	
	/**   
	 *******************************************************************************
	 * @function : 拒绝关注
	 * @param sessionUserInfo
	 * @param userId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-1   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	JsonResult refuseFollow(UserInfo sessionUserInfo,Long userId);
	
	/**   
	 *******************************************************************************
	 * @function : 获取发送申请好友
	 * @param pageNum
	 * @param pageSize
	 * @param userId
	 * @return
	 *******************************************************************************
	 * @creator ：majun   
	 * @date ：2013-3-8   
	 *******************************************************************************
	 * @revisor ：   
	 * @date ：   
	 * @memo ：   
	 *******************************************************************************
	 */
	PaginationDTO<UserInfo> findSendApplyFriendsPage(long pageNum,long pageSize,Long userId);
}
